//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема контекста игры
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaGameErrors.cs
*		Работа с ошибками подсистемы работы с контекстом игрока.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaGameContext
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения ошибок подсистемы работы с контекстом игрока
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XGameErrors
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Контекст игры не найден
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 1000,
                Message = "Контекст игры не найден",
                Succeeded = false,
            };

			/// <summary>
			/// Сохранение игры не найдено
			/// </summary>
			public static readonly Result SaveNotFound = new()
			{
				Code = 1002,
				Message = "Сохранение игры не найдено",
				Succeeded = false,
			};
			#endregion
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================