//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема изображений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaImageErrors.cs
*		Работа с ошибками подсистемы работы с изображениями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaImage
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения ошибок подсистемы работы с изображениями
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XImageErrors
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Изображение не найдено
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 1000,
                Message = "Изображение не найдено",
                Succeeded = false,
            };

			/// <summary>
			/// Нельзя удалить константное изображение
			/// </summary>
			public static readonly Result NotDeleteConst = new()
            {
                Code = 1002,
                Message = "Нельзя удалить константное изображение",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================