//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема конфигурации и инициализации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaDbConfiguration.cs
*		Статический класс для конфигурации и инициализации базы данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Microsoft.EntityFrameworkCore;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
    {
        //-------------------------------------------------------------------------------------------------------------
        /**
         * \defgroup DeNovaConfiguration Подсистема конфигурации и инициализации
         * \ingroup DeNova
         * \brief Подсистема конфигурации и инициализации.
         * @{
         */
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для конфигурации и инициализации базы данных
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XDbConfiguration
        {
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Конфигурация и первоначальная инициализация базы данных
            /// </summary>
            /// <remarks>
            /// Вызывается в <see cref="CDeNovaDbContext.OnModelCreating(ModelBuilder)"/>
            /// </remarks>
            /// <param name="modelBuilder">Интерфейс для построения моделей</param>
            //---------------------------------------------------------------------------------------------------------
            public static void ConfigurationDenovaDatabase(ModelBuilder modelBuilder)
            {
				//
				// ТЕРРИТОРИАЛЬНО-АДРЕСНОЕ ХОЗЯЙСТВО
				//
				CAddressElement.ModelCreating(modelBuilder);
				CAddressStreet.ModelCreating(modelBuilder);
				CAddressVillage.ModelCreating(modelBuilder);
				CAddressVillageSettlement.ModelCreating(modelBuilder);

				//
				// ПЕРСОНАЖ
				//
				CPerson.ModelCreating(modelBuilder);
				CAddressInfo.ModelCreating(modelBuilder);
				CAstrologyInfo.ModelCreating(modelBuilder);
				CAvatarInfo.ModelCreating(modelBuilder);
				CBirthdayInfo.ModelCreating(modelBuilder);
				CFamilyTies.ModelCreating(modelBuilder);
				CIdentityInfo.ModelCreating(modelBuilder);

				// Первоначальная инициализация через миграцию
				XDbSeed.Create(modelBuilder);
			}
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================