//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметров существ
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaParameterTypeErrors.cs
*		Работа с ошибками подсистемы параметров существ.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaCreatureParameter
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения ошибок подсистемы параметров существ
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XParameterTypeErrors
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Параметр не найден
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 1000,
                Message = "Параметр не найден",
                Succeeded = false,
            };

			/// <summary>
			/// Нельзя удалить константный параметр
			/// </summary>
			public static readonly Result NotDeleteConst = new()
            {
                Code = 1002,
                Message = "Нельзя удалить константный параметр",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================