//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметров существ
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaParameterTypeCreateRequest.cs
*		Класс для создания нового параметра существа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaCreatureParameter
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания нового параметра существа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class ParameterTypeCreateRequest
		{
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? GameSettingTypeId { get; set; }

			/// <summary>
			/// Название параметра
			/// </summary>
			public String Name { get; set; } = null!;

			/// <summary>
			/// Название параметра для отображения
			/// </summary>
			public String? DisplayName { get; set; }

			/// <summary>
			/// Дополнительная информация
			/// </summary>
			public String? AdditionalInfo { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================