//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема перемещения персонажа
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaPlacementStateDto.cs
*		Класс для определения местоположения персонажа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
using Lotus.Maths;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaPlacementState
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения местоположения персонажа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class PlacementStateDto : PersonStateDto
        {
			/// <summary>
			/// Идентификатор сущности
			/// </summary>
			public Guid PlacementStateId { get; set; }

			/// <summary>
			/// Позиция персонажа по X
			/// </summary>
			public Int32 PositionX { get; set; }

			/// <summary>
			/// Позиция персонажа по Y
			/// </summary>
			public Int32 PositionY { get; set; }

			/// <summary>
			/// Позиция персонажа по Z
			/// </summary>
			public Int32 PositionZ { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================