//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема персонажа
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaPersonDto.cs
*		Класс персонажа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup DeNovaPerson
        *@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс персонажа
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class PersonDto : IdentifierDtoId<Guid>
        {
			/// <summary>
			/// Имя персонажа
			/// </summary>
			public String Name { get; set; } = null!;

			/// <summary>
			/// Идентификатор расы
			/// </summary>
			public Int32 RaceTypeId { get; set; }

			/// <summary>
			/// Идентификатор аватара
			/// </summary>
			public Guid? AvatarId { get; set; }

			/// <summary>
			/// Статус локального изображения для аватара
			/// </summary>
			public Boolean? IsLocalAvatar { get; set; }

			/// <summary>
			/// Идентификатор информации о астрологических сведениях
			/// </summary>
			public Int32? AstrologyTypeId { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================