//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема данных астрологии
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaAstrologyTypeDto.cs
*		Класс для определения данных по астрологии.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaAstrologyType
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для определения данных по астрологии
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class AstrologyTypeDto : IdentifierDtoId<Int32>
        {
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? GameSettingTypeId { get; set; }

			/// <summary>
			/// Знак зодиака
			/// </summary>
			public String? ZodiacSign { get; set; }

			/// <summary>
			/// Камень по знаку зодиака
			/// </summary>
			public String? StoneZodiac { get; set; }

			/// <summary>
			/// Дерево по знаку зодиака
			/// </summary>
			public String? TreeZodiac { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================