//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема астрологических данных
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaAstrologyConstants.cs
*		Работа с константными и первоначальными данными подсистемы астрологических данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaAstrology
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения констант и первоначальных данных подсистемы астрологических данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XAstrologyConstants
		{
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Змееносец
			/// </summary>
			public static readonly Astrology Ophiuchus = new Astrology()
            {
                Id = 1,
                ZodiacSign = "Змееносец",
				StoneZodiac = "Алмаз",
				TreeZodiac = "Лиана",
				CampaignSettingId = XCampaignSettingConstants.Sentra.Id
			};

			/// <summary>
			/// Кецалькоатль
			/// </summary>
			public static readonly Astrology Quetzalcoatl = new Astrology()
			{
				Id = 2,
				ZodiacSign = "Кецалькоатль",
				StoneZodiac = "Изумруд",
				TreeZodiac = "Ива",
				CampaignSettingId = XCampaignSettingConstants.Sentra.Id
			};

			/// <summary>
			/// Телец
			/// </summary>
			public static readonly Astrology Taurus = new Astrology()
			{
				Id = 3,
				ZodiacSign = "Телец",
				StoneZodiac = "Топаз",
				TreeZodiac = "Дуб",
				CampaignSettingId = XCampaignSettingConstants.Sentra.Id
			};
			#endregion
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================