//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема изображений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaImageDto.cs
*		Класс изображения.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup DeNovaImage
        *@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс изображения
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class ImageDto : IdentifierDtoId<Int32>
        {
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? CampaignSettingId { get; set; }

			/// <summary>
			/// Название изображения
			/// </summary>
			public String Name { get; set; } = null!;

			/// <summary>
			/// Статус локального изображения (которое храниться на клиенте)
			/// </summary>
			public Boolean IsLocal { get; set; }

			/// <summary>
			/// Uri для загрузки изображения
			/// </summary>
			public String? LoadPath { get; set; }

			/// <summary>
			/// Данные изображения
			/// </summary>
			public Byte[]? DataImage { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================