//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема астрологических данных
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaAstrologyCreateDto.cs
*		Класс для создания новых астрологических данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaAstrology
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания новых астрологических данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class AstrologyCreateDto
        {
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? CampaignSettingId { get; set; }

			/// <summary>
			/// Знак зодиака
			/// </summary>
			public String? ZodiacSign { get; set; }

			/// <summary>
			/// Камень по знаку зодиака
			/// </summary>
			public String? StoneZodiac { get; set; }

			/// <summary>
			/// Дерево по знаку зодиака
			/// </summary>
			public String? TreeZodiac { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================