//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметров существ
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaParameterAspectTypeCreateRequest.cs
*		Класс для создания нового аспекта параметра существа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
using System.ComponentModel.DataAnnotations;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaCreatureParameter
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для создания нового аспекта параметра существа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class ParameterAspectTypeCreateRequest
		{
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? GameSettingTypeId { get; set; }

			/// <summary>
			/// Идентификатор параметра
			/// </summary>
			public Int32 ParameterTypeId { get; set; }

			/// <summary>
			/// Название аспекта параметра
			/// </summary>
			public String Name { get; set; } = null!;

			/// <summary>
			/// Название аспекта параметра для отображения
			/// </summary>
			public String? DisplayName { get; set; }

			/// <summary>
			/// Дополнительная информация
			/// </summary>
			public String? AdditionalInfo { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================