//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметров существ
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaParameterAspectTypesRequest.cs
*		Класс для получения списка аспектов параметров существ с учетом фильтрации и сортировки.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaCreatureParameter
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс для получения списка аспектов параметров существ с учетом фильтрации и сортировки
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class ParameterAspectTypesRequest : Request
        {
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? GameSettingTypeId { get; set; }

			/// <summary>
			/// Идентификатор параметра
			/// </summary>
			public Int32? ParameterTypeId { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================