//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема изображений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaImageCreateDto.cs
*		Класс для создания нового изображения.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup DeNovaImage
        *@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс для создания нового изображения
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class ImageCreateDto
        {
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? CampaignSettingId { get; set; }

			/// <summary>
			/// Наименование изображения
			/// </summary>
			public String? Name { get; set; }

			/// <summary>
			/// Статус локального изображения (которое храниться на клиенте)
			/// </summary>
			public Boolean IsLocal { get; set; }

			/// <summary>
			/// Uri для загрузки изображения
			/// </summary>
			public String? LoadPath { get; set; }

			/// <summary>
			/// Ширина изображения в пикселях
			/// </summary>
			public Int32? Width { get; set; }

			/// <summary>
			/// Высота изображения в пикселях
			/// </summary>
			public Int32? Height { get; set; }

			/// <summary>
			/// Размер изображения в байтах
			/// </summary>
			public Int32 SizeInBytes { get; set; }

			/// <summary>
			/// Данные изображения
			/// </summary>
			public Byte[]? DataImage { get; set; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================