//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметра персонажа
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaPersonParameterAspectDto.cs
*		Класс аспекта параметра персонажа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaPersonParameter
        *@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Класс аспекта параметра персонажа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class PersonParameterAspectDto : IdentifierDtoId<Guid>
        {
			/// <summary>
			/// Идентификатор типа аспекта параметра
			/// </summary>
			public Int32 ParameterAspectTypeId { get; set; }

			/// <summary>
			/// Идентификатор параметра персонажа кторому принадлежит данный аспект
			/// </summary>
			public Guid PersonParameterId { get; set; }

			/// <summary>
			/// Идентификатор персонажа
			/// </summary>
			public Guid PersonId { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================