//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметров существ
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaParameterAspectTypeErrors.cs
*		Работа с ошибками подсистемы аспектов параметров существами.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaCreatureParameter
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения ошибок подсистемы аспектов параметров существами
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XParameterAspectTypeErrors
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Аспекта параметра существа не найден
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 1000,
                Message = "Аспекта параметра существа не найден",
                Succeeded = false,
            };

            /// <summary>
            /// Нельзя удалить константный аспект параметра существа
            /// </summary>
            public static readonly Result NotDeleteConst = new()
            {
                Code = 1002,
                Message = "Нельзя удалить константный аспект параметра существа",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================