//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема параметров существ
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaParameterAspectTypeConstants.cs
*		Работа с константными и первоначальными данными подсистемы аспектов параметров существ.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaParameterAspectType
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения констант и первоначальных данных подсистемы аспектов параметров существ
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XParameterAspectTypeConstants
		{
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Сильные руки
			/// </summary>
			public static readonly ParameterAspectType StrongArms = new ParameterAspectType()
			{
				Id = 1,
				Name = "StrongArms",
				DisplayName = "Сильные руки",
				ParameterTypeId = XParameterTypeConstants.PhysicalStrength.Id,
				GameSettingTypeId = XGameSettingTypeConstants.Sentra.Id
			};
			#endregion
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================