//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема аватара персонажа
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaAvatarInfoInterface.cs
*		Определение интерфейса сервиса для работы с аватаром персонажа.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Account;
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaAvatarInfo
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс сервиса для работы с аватаром персонажа
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusAvatarInfoService
        {
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Создание аватара персонажа по указанным данным
            /// </summary>
            /// <param name="avatarInfoCreate">Параметры для создания аватара персонажа</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Аватар персонажа</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response<AvatarInfoDto>> CreateAsync(AvatarInfoCreateDto avatarInfoCreate, CancellationToken token);

            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Обновление данных аватара персонажа
            /// </summary>
            /// <param name="avatarInfoUpdate">Параметры обновляемой аватара персонажа</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Аватар персонажа</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response<AvatarInfoDto>> UpdateAsync(AvatarInfoDto avatarInfoUpdate, CancellationToken token);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение указанного аватара персонажа
			/// </summary>
			/// <param name="avatarInfoId">Идентификатор аватара персонажа</param>
			/// <param name="token">Токен отмены</param>
			/// <returns>Аватар персонажа</returns>
			//---------------------------------------------------------------------------------------------------------
			Task<Response<AvatarInfoDto>> GetAsync(Guid avatarInfoId, CancellationToken token);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение списка мест жительств персонажа 
			/// </summary>
			/// <param name="avatarInfoRequest">Параметры получения списка</param>
			/// <param name="token">Токен отмены</param>
			/// <returns>Список аватаров персонажа</returns>
			//---------------------------------------------------------------------------------------------------------
			Task<ResponsePage<AvatarInfoDto>> GetAllAsync(AvatarInfosDto avatarInfoRequest, CancellationToken token);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Удаление аватара персонажа
			/// </summary>
			/// <param name="avatarInfoId">Идентификатор аватара персонажа</param>
			/// <param name="token">Токен отмены</param>
			/// <returns>Статус успешности</returns>
			//---------------------------------------------------------------------------------------------------------
			Task<Response> DeleteAsync(Guid avatarInfoId, CancellationToken token);
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================