//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема астрологических данных
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaAstrologyErrors.cs
*		Работа с ошибками подсистемы астрологических данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaAstrology
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения ошибок подсистемы астрологических данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XAstrologyErrors
        {
			#region ======================================= ДАННЫЕ ====================================================
			/// <summary>
			/// Астрологические данные не найдены
			/// </summary>
			public static readonly Result NotFound = new()
            {
                Code = 1000,
                Message = "Астрологические данные не найдены",
                Succeeded = false,
            };

			/// <summary>
			/// Нельзя удалить константные астрологические данные
			/// </summary>
			public static readonly Result NotDeleteConst = new()
            {
                Code = 1002,
                Message = "Нельзя удалить константные астрологические данные",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================