//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема астрологических данных
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaAstrologyInterface.cs
*		Определение интерфейса сервиса для работы с астрологическими данными.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup DeNovaAstrology
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс сервиса для работы с астрологическими данными
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusAstrologyService
        {
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Создание астрологических данных по указанным данным
            /// </summary>
            /// <param name="astrologyCreate">Параметры для создания астрологических данных</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Астрологические данные</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response<AstrologyDto>> CreateAsync(AstrologyCreateDto astrologyCreate, CancellationToken token);

            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Обновление данных указанной астрологических данных
            /// </summary>
            /// <param name="astrologyUpdate">Параметры обновляемой астрологических данных</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Астрологические данные</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response<AstrologyDto>> UpdateAsync(AstrologyDto astrologyUpdate, CancellationToken token);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение указанной астрологических данных
			/// </summary>
			/// <param name="id">Идентификатор астрологических данных</param>
			/// <param name="token">Токен отмены</param>
			/// <returns>Астрологические данные</returns>
			//---------------------------------------------------------------------------------------------------------
			Task<Response<AstrologyDto>> GetAsync(Int32 id, CancellationToken token);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение списка астрологических данных
			/// </summary>
			/// <param name="astrologyRequest">Параметры получения списка</param>
			/// <param name="token">Токен отмены</param>
			/// <returns>Cписок астрологических данных</returns>
			//---------------------------------------------------------------------------------------------------------
			Task<ResponsePage<AstrologyDto>> GetAllAsync(AstrologiesDto astrologyRequest, CancellationToken token);

            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Удаление астрологических данных
            /// </summary>
            /// <param name="id">Идентификатор астрологических данных</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Статус успешности</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response> DeleteAsync(Int32 id, CancellationToken token);
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================