//=====================================================================================================================
// Проект: Модуль игровой вселенной DeNova
// Раздел: Подсистема рас
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusDeNovaRaceTypeCreateRequest.cs
*		Класс для создания новой расы.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
using System.ComponentModel.DataAnnotations;
//=====================================================================================================================
namespace Lotus
{
    namespace DeNova
	{
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup DeNovaRaceType
        *@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс для создания новой расы
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class RaceTypeCreateRequest
		{
			/// <summary>
			/// Идентификатор сеттинга игры
			/// </summary>
			public Int32? GameSettingTypeId { get; set; }

			/// <summary>
			/// Название расы
			/// </summary>
			public String Name { get; set; } = null!;

			/// <summary>
			/// Название расы для отображения
			/// </summary>
			public String? DisplayName { get; set; }

			/// <summary>
			/// Дополнительная информация
			/// </summary>
			public String? AdditionalInfo { get; set; }
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================